cask_args appdir: '/Applications'
# install packages
tap 'homebrew/cask' || true
tap 'homebrew/cask-fonts' || true
tap 'homebrew/cask-versions' || true
tap 'StevenACoffman/jt' || true
brew 'git'
brew 'byobu'
brew 'openconnect'
brew 'git-crypt'
brew 'git-remote-codecommit'
brew 'composer'
brew 'certbot'
brew 'sonar-scanner'
brew 'nmap'
brew 'lynx'
brew 'mtr'
brew 'pwgen'
brew 'plantuml'
brew 'watch'
brew 'p7zip'
brew 'jmeter'
brew 'ykman'
brew 'ykneomgr'
brew 'tree'
brew 'nodenv'
brew 'nvm'
brew 'bind'
brew 'vim'
brew 'pass'
brew 'irssi'
brew 'bash'
brew 'bash-completion@2'
brew 'bash-git-prompt'
brew 'alpine'
brew 'clamav'
brew 'ffmpeg'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'python3'
brew 'telnet'
brew 'openshift-cli'
brew 'duplicity'
brew 'midnight-commander'
brew 'screen'
brew 'tfenv'
brew 'gnutls'
brew 'govendor'
brew 'gimme'
brew 'packer'
brew 'wget'
brew 'youtube-dl'
brew 'yarn'
brew 'openssl'
brew 'openssh'
brew 'zbar'
brew 'ansible'
brew 'sipcalc'
brew 'mosh'
brew 'awsume'
brew 'libaacs'
brew 'yubico-piv-tool'
brew 'yubikey-personalization'
brew 'kops'
brew 'helm'
brew 'tgenv'
brew 'jq'
brew 'dos2unix'
brew 'bitwarden-cli'
brew 'lynis'
brew 'awscli'
brew 'multimarkdown'
brew 'jenv'
brew 'tnef'
brew 'terraformer'
brew 'svn'
brew 'mas'
brew 'terraform-docs'
brew 'tflint'
brew 'tfsec'
brew 'terrascan'
brew 'pre-commit'
brew 'ncftp'
brew 'infracost'
brew 'aws-cdk'
brew 'graphviz'
brew 'syncthing'
brew 'gnupg'
brew 'pinentry-mac'
brew 'detect-secrets'
brew 'hadolint'
brew 'rclone'
cask 'balenaetcher'
cask 'discord'
cask 'drawio'
cask 'thunderbird'
cask 'chromium'
cask 'whatsapp'
brew 'wget'
brew 'f3'
brew 'localstack'
brew 'age'
brew 'chezmoi'
brew 'docker'
brew 'docker-credential-helper'
brew 'docker-credential-helper-ecr'
brew 'colima'
brew 'azure-cli'
brew 'gh'
brew 'restic'
#brew 'wireshark'
#cask 'wireshark'
# Casks
cask 'google-chrome'
cask 'vlc'
cask 'gimp'
cask 'libreoffice'
cask 'zotero'
cask 'skype'
#cask 'virtualbox'
#cask 'virtualbox-extension-pack'
cask 'kindle'
cask 'iterm2'
cask 'calibre'
cask 'arduino'
cask 'atom'
cask 'electrum'
cask 'tor-browser'
cask 'vagrant'
cask 'firefox'
#xquartz before inkscape
cask 'xquartz'
cask 'inkscape'
cask 'tunnelblick'
cask 'nextcloud'
cask 'adium'
cask 'dash'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-source-code-pro'
cask 'blender'
cask 'cura-lulzbot'
cask 'duet'
cask 'signal'
cask 'veracrypt'
cask 'knockknock'
#cask 'oversight' # commenting out as there is a problem with the install
cask 'nagbar'
cask 'kobo'
cask 'vnc-viewer'
cask 'bitwarden'
cask 'jetbrains-toolbox'
cask 'protonvpn'
cask 'mactex'
cask 'microsoft-teams'
cask 'ngrok'
cask 'amazon-chime'
cask 'phantomjs'
cask 'session-manager-plugin'
cask 'sensiblesidebuttons'
cask 'joplin'
cask 'element'
cask 'openra'
cask 'lunar'
cask 'nheko'
brew 'asdf'
cask 'barrier'
brew 'cloud-nuke'
cask 'aws-vpn-client'
cask 'vscodium'
cask 'nvidia-geforce-now'
cask 'amazon-luna'
cask 'slack'
cask 'github'
cask 'linearmouse'
cask 'orbstack'
cask 'corretto17'
