cask_args appdir: '/Applications'
# install packages
tap 'StevenACoffman/jt' || true
tap 'hashicorp/tap' || true
tap 'tabbyml/tabby' || true
tap 'aws/tap' || true
brew 'git'
brew 'byobu'
brew 'openconnect'
brew 'git-crypt'
brew 'git-remote-codecommit'
brew 'composer'
brew 'certbot'
brew 'sonar-scanner'
brew 'nmap'
brew 'lynx'
brew 'mtr'
brew 'pwgen'
brew 'plantuml'
brew 'watch'
brew 'p7zip'
brew 'jmeter'
brew 'ykman'
brew 'tree'
brew 'nodenv'
brew 'nvm'
brew 'bind'
brew 'vim'
brew 'pass'
brew 'irssi'
brew 'bash'
brew 'bash-preexec'
brew 'bash-completion@2'
brew 'bash-git-prompt'
brew 'starship'
brew 'alpine'
brew 'clamav'
brew 'ffmpeg'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'python3'
brew 'telnet'
brew 'openshift-cli'
brew 'duplicity'
brew 'midnight-commander'
brew 'screen'
brew 'gnutls'
brew 'gimme'
#brew 'packer'
brew 'wget'
brew 'yarn'
brew 'openssl'
brew 'openssh'
brew 'zbar'
brew 'ansible'
brew 'sipcalc'
brew 'mosh'
brew 'awsume'
brew 'libaacs'
brew 'yubico-piv-tool'
brew 'yubikey-personalization'
brew 'kops'
brew 'helm'
brew 'jq'
brew 'dos2unix'
brew 'bitwarden-cli'
brew 'lynis'
brew 'awscli'
brew 'multimarkdown'
brew 'jenv'
brew 'tnef'
brew 'terraformer'
brew 'svn'
brew 'mas'
brew 'terraform-docs'
brew 'tflint'
brew 'tfsec'
brew 'terrascan'
brew 'pre-commit'
brew 'ncftp'
brew 'infracost'
brew 'aws-cdk'
brew 'graphviz'
brew 'syncthing'
brew 'gnupg'
brew 'pinentry-mac'
brew 'detect-secrets'
brew 'hadolint'
brew 'rclone'
brew 'get_iplayer'
brew 'atuin'
brew 'kind'
brew 'sshpass'
brew 'tektoncd-cli'
brew 'step'
brew 'golang'
brew 'goreleaser'
brew 'cocogitto'
brew 'amazon-ecs-cli'
brew 'rust'
brew 'opentofu'
brew 'terragrunt'
brew 'zola'
brew 'eksctl'
brew 'git-lfs'
brew 'zellij'
brew 'nvim'
brew 'rage'
brew 'ocrmypdf'
brew 'aider'
brew 'gitleaks'
brew 'stripe-cli'
brew 'postgresql'
brew 'magic-wormhole'
brew 'icann-rdap'
cask 'discord'
cask 'thunderbird'
cask 'chromium'
cask 'whatsapp'
brew 'wget'
brew 'f3'
brew 'localstack'
brew 'age'
brew 'chezmoi'
#brew 'docker'
brew 'docker-credential-helper'
brew 'docker-credential-helper-ecr'
brew 'colima'
brew 'azure-cli'
brew 'gh'
brew 'restic'
brew 'mono'
#brew 'podman'
# Casks
cask 'google-chrome'
cask 'vlc'
cask 'gimp'
cask 'libreoffice'
cask 'zotero'
cask 'virtualbox'
#cask 'virtualbox-extension-pack'
cask 'iterm2'
cask 'calibre'
cask 'electrum'
cask 'tor-browser'
cask 'vagrant'
cask 'firefox'
#xquartz before inkscape
cask 'xquartz'
cask 'inkscape'
cask 'tunnelblick'
cask 'nextcloud'
cask 'adium'
cask 'dash'
cask 'blender'
cask 'cura-lulzbot'
cask 'duet'
cask 'signal'
cask 'veracrypt'
cask 'nagbar'
cask 'kobo'
cask 'vnc-viewer'
cask 'bitwarden'
cask 'protonvpn'
cask 'microsoft-teams'
cask 'ngrok'
cask 'amazon-chime'
cask 'session-manager-plugin'
cask 'sensiblesidebuttons'
cask 'joplin'
cask 'element'
cask 'openra'
cask 'lunar'
cask 'nheko'
brew 'asdf'
cask 'barrier'
brew 'cloud-nuke'
cask 'vscodium'
cask 'amazon-luna'
cask 'slack'
cask 'github'
cask 'linearmouse'
cask 'orbstack'
#cask 'corretto17'
cask 'beeper'
cask 'simplenote'
#cask 'proton-drive' # Install via Brew doesn't provide Finder folder integration
cask 'standard-notes'
cask 'drawio'
cask 'podman-desktop'
cask 'lapce'
cask 'chatgpt'
cask 'copilot'
cask 'lm-studio'
cask 'proton-mail'
cask 'proton-pass'
cask 'cap'
cask 'anytype'
cask 'transmission'
cask 'warp'
cask 'alacritty'
cask 'wave'
cask 'tableau'
cask 'tailscale'
cask 'cursor'
cask 'visual-studio-code'
cask 'snes9x'
cask 'docker'
cask 'stats'
cask 'mattermost'
cask 'jan'
cask 'ledger-live'
cask 'monero-wallet'
# Hashicorp tap
brew 'hashicorp/tap/nomad'
brew 'hashicorp/tap/terraform'
brew 'hashicorp/tap/vault'
# Tabby tap
brew 'tabbyml/tabby/tabby'
brew 'aws/tap/lightsailctl'
# Axiom tap
brew 'axiomhq/tap/axiom'
brew 'axiomhq/tap/axiom-cli'
